-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/data/ransom/CollegeMaj/ACS-immigration/Data/cr_bpl_vars_80.l
> og
  log type:  text
 opened on:   1 Feb 2018, 13:02:30

. 
. !gunzip -f bpl_vars_80.dat.gz


. 
. *1980
. set more off

. clear

. quietly infix                ///
> int     year      1-4      ///
> byte    datanum   5-6      ///
> double  serial    7-14     ///
> float   hhwt      15-24    ///
> byte    statefip  25-26    ///
> int     metarea   27-29    ///
> int     metaread  30-33    ///
> int     cntygp98  34-36    ///
> int     conspuma  37-39    ///
> byte    gq        40-40    ///
> int     pernum    41-44    ///
> float   perwt     45-54    ///
> byte    sex       55-55    ///
> int     age       56-58    ///
> byte    marst     59-59    ///
> byte    race      60-60    ///
> int     raced     61-63    ///
> byte    hispan    64-64    ///
> int     hispand   65-67    ///
> int     bpl       68-70    ///
> long    bpld      71-75    ///
> byte    citizen   76-76    ///
> byte    school    77-77    ///
> byte    educ      78-79    ///
> int     educd     80-82    ///
> byte    empstat   83-83    ///
> byte    empstatd  84-85    ///
> int     occ1990   86-88    ///
> byte    wkswork1  89-90    ///
> byte    wkswork2  91-91    ///
> byte    uhrswork  92-93    ///
> long    incwage   94-99    ///
> long    incbus    100-105  ///
> long    incfarm   106-111  ///
> byte    pwstate2  112-113  ///
> int     pwcntygp  114-116  ///
> byte    quhrswor  117-117  ///
> byte    qwkswork  118-118  ///
> byte    qincbus   119-119  ///
> byte    qincfarm  120-120  ///
> byte    qincwage  121-121  ///
> using bpl_vars_80.dat  ///
> if age>=25 & age<=59 & year==1980

. 
. !gzip -f bpl_vars_80.dat


. 
. replace perwt    = perwt    / 100
(4,853,816 real changes made)

. 
. gen     ed16plus=0

. gen     foreignborn=0

. gen     asianborn=0

. gen     latinborn=0

. gen     africborn=0

. gen     canukborn=0

. gen     canadborn=0

. gen     uk___born=0

. gen     roe__born=0

. gen     chinaborn=0

. gen     indiaborn=0

. gen     cjk__born=0

. replace ed16plus=1 if educd>=100
(921,154 real changes made)

. replace foreignborn=1  if bpl>56
(404,588 real changes made)

. replace asianborn=1    if bpl>=500 & bpl<=599
(75,902 real changes made)

. replace latinborn=1    if bpl>=200 & bpl<=399
(122,776 real changes made)

. replace africborn=1    if bpl==600
(6,232 real changes made)

. replace canadborn=1    if bpl==150 
(20,974 real changes made)

. replace uk___born=1    if bpl>=410 & bpl<=414
(22,445 real changes made)

. replace canukborn=1    if bpl==150 | (bpl>=410 & bpl<=414)
(43,419 real changes made)

. replace roe__born=1    if bpl>=400 & (bpl<=405 | bpl>=419) & bpl<=499
(98,843 real changes made)

. replace chinaborn=1    if bpl==500
(14,245 real changes made)

. replace indiaborn=1    if bpl==521
(9,511 real changes made)

. replace cjk__born=1    if bpl>=500 & bpl<=502
(30,151 real changes made)

. gen     roa__born=asianborn - indiaborn - cjk__born

. gen     oas__born=asianborn - indiaborn - chinaborn

. 
. sum *born

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 foreignborn |  4,853,816    .0833546    .2764175          0          1
   asianborn |  4,853,816    .0156376    .1240688          0          1
   latinborn |  4,853,816    .0252947    .1570188          0          1
   africborn |  4,853,816    .0012839    .0358091          0          1
   canukborn |  4,853,816    .0089453    .0941558          0          1
-------------+---------------------------------------------------------
   canadborn |  4,853,816    .0043211    .0655932          0          1
   uk___born |  4,853,816    .0046242     .067844          0          1
   roe__born |  4,853,816     .020364     .141242          0          1
   chinaborn |  4,853,816    .0029348    .0540943          0          1
   indiaborn |  4,853,816    .0019595    .0442227          0          1
-------------+---------------------------------------------------------
   cjk__born |  4,853,816    .0062118    .0785699          0          1
   roa__born |  4,853,816    .0074663    .0860845          0          1
   oas__born |  4,853,816    .0107433    .1030916          0          1

. 
. drop bpl

. gen  bpl=statefip

. *variables are defined to merge with ACS data via bpl
. gen  native=1-foreignborn

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  4,853,816        1980           0       1980       1980
     datanum |  4,853,816           1           0          1          1
      serial |  4,853,816     2359273     1360589          1    4711341
        hhwt |  4,853,816        2000           0       2000       2000
    statefip |  4,853,816    28.14481    15.40679          1         56
-------------+---------------------------------------------------------
     metarea |  4,853,816    320.0721    294.1625          0        932
    metaread |  4,853,816    3200.826    2941.696          0       9320
    cntygp98 |  4,853,816    22.25069    16.28245          1         72
    conspuma |  4,853,816    254.6395    160.4314          1        543
          gq |  4,853,816    1.027343    .2577042          1          4
-------------+---------------------------------------------------------
      pernum |  4,853,816    1.543827    .7412981          1         20
       perwt |  4,853,816          20           0         20         20
         sex |  4,853,816     1.51304      .49983          1          2
         age |  4,853,816    39.98842    10.35947         25         59
       marst |  4,853,816    2.000656    1.773715          1          6
-------------+---------------------------------------------------------
        race |  4,853,816    1.217544    .7485902          1          7
       raced |  4,853,816    122.1213    75.94038        100        700
      hispan |  4,853,816    .1163163    .5547583          0          4
     hispand |  4,853,816    12.97386    65.19099          0        498
        bpld |  4,853,816    5897.433    11110.38        100      90020
-------------+---------------------------------------------------------
     citizen |  4,853,816    .1898072    .6774794          0          3
      school |  4,853,816    1.051638    .2212941          1          2
        educ |  4,853,816     6.44388    2.633728          0         11
       educd |  4,853,816    65.20549    25.62753          2        113
     empstat |  4,853,816    1.521072    .8559781          1          3
-------------+---------------------------------------------------------
    empstatd |  4,853,816    15.27942    8.529502         10         30
     occ1990 |  4,853,816     488.511     317.303          3        999
    wkswork1 |  4,853,816    35.60488     21.5929          0         52
    wkswork2 |  4,853,816    3.972181    2.495324          0          6
    uhrswork |  4,853,816    31.42886    19.41709          0         99
-------------+---------------------------------------------------------
     incwage |  4,853,816    10160.48    11093.48          0      75000
      incbus |  4,853,816    791.4465     5038.97      -9995      75000
     incfarm |  4,853,816    117.8383    1824.887      -9995      75000
    pwstate2 |  4,853,816    11.90174    21.65198          0         99
    pwcntygp |  4,853,816     7.09045    13.82966          0         99
-------------+---------------------------------------------------------
    quhrswor |  4,853,816    .2732448    1.009117          0          4
    qwkswork |  4,853,816    .2675946    .9927988          0          4
     qincbus |  4,853,816    .4978162    1.226382          0          4
    qincfarm |  4,853,816    .5239986     1.28317          0          4
    qincwage |  4,853,816    .5386887    1.288258          0          4
-------------+---------------------------------------------------------
    ed16plus |  4,853,816    .1897793    .3921265          0          1
 foreignborn |  4,853,816    .0833546    .2764175          0          1
   asianborn |  4,853,816    .0156376    .1240688          0          1
   latinborn |  4,853,816    .0252947    .1570188          0          1
   africborn |  4,853,816    .0012839    .0358091          0          1
-------------+---------------------------------------------------------
   canukborn |  4,853,816    .0089453    .0941558          0          1
   canadborn |  4,853,816    .0043211    .0655932          0          1
   uk___born |  4,853,816    .0046242     .067844          0          1
   roe__born |  4,853,816     .020364     .141242          0          1
   chinaborn |  4,853,816    .0029348    .0540943          0          1
-------------+---------------------------------------------------------
   indiaborn |  4,853,816    .0019595    .0442227          0          1
   cjk__born |  4,853,816    .0062118    .0785699          0          1
   roa__born |  4,853,816    .0074663    .0860845          0          1
   oas__born |  4,853,816    .0107433    .1030916          0          1
         bpl |  4,853,816    28.14481    15.40679          1         56
-------------+---------------------------------------------------------
      native |  4,853,816    .9166454    .2764175          0          1

. 
. gen     stemocc=occ1990

. recode  stemocc  44/64=1 66/83=1 229=1                  else=0
(stemocc: 4853816 changes made)

. gen     stemocc2=occ1990

. recode  stemocc2 44/64=1 66/83=1 229=1  84/89=1 96=1  113/116=1 127/128=1 els
> e=0
(stemocc2: 4853816 changes made)

. 
. sum year stem* [aweight=perwt]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        year | 4853816    97076320        1980          0       1980       1980
     stemocc | 4853816    97076320    .0204322   .1414733          0          1
    stemocc2 | 4853816    97076320    .0279879    .164938          0          1

. sum year stem* [aweight=perwt] if educd>=101

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        year | 437,175     8743500        1980          0       1980       1980
     stemocc | 437,175     8743500    .0716372   .2578866          0          1
    stemocc2 | 437,175     8743500    .1442283   .3513215          0          1

. bysort bpl: egen double totwt_80_2559           =total(perwt)

. bysort bpl: egen double pct_ed16plus_80_2559    =total(perwt*ed16plus        
> /totwt_80_2559)

. bysort bpl: egen double pct_foreign_80_2559     =total(perwt*foreignborn     
> /totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_for_80_2559=total(perwt*ed16plus*foreign
> /totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_asi_80_2559=total(perwt*ed16plus*asianbo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_chi_80_2559=total(perwt*ed16plus*chinabo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_ind_80_2559=total(perwt*ed16plus*indiabo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_lat_80_2559=total(perwt*ed16plus*latinbo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_afr_80_2559=total(perwt*ed16plus*africbo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_cjk_80_2559=total(perwt*ed16plus*cjk__bo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_roa_80_2559=total(perwt*ed16plus*roa__bo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_oas_80_2559=total(perwt*ed16plus*oas__bo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_cuk_80_2559=total(perwt*ed16plus*canukbo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_roe_80_2559=total(perwt*ed16plus*roe__bo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_can_80_2559=total(perwt*ed16plus*canadbo
> rn/totwt_80_2559)

. bysort bpl: egen double pct_ed16plus_uks_80_2559=total(perwt*ed16plus*uk___bo
> rn/totwt_80_2559)

. 
. bysort bpl: egen double pct_16pl_stemo_all_80_2559=total(perwt*ed16plus*stemo
> cc         /totwt_80_2559)

. bysort bpl: egen double pct_16pl_stem2_all_80_2559=total(perwt*ed16plus*stemo
> cc2        /totwt_80_2559)

. bysort bpl: egen double pct_16pl_stemo_for_80_2559=total(perwt*ed16plus*stemo
> cc *foreign/totwt_80_2559)

. bysort bpl: egen double pct_16pl_stem2_for_80_2559=total(perwt*ed16plus*stemo
> cc2*foreign/totwt_80_2559)

. 
. bysort bpl: egen double pct_16pl_nstemo_all_80_2559=total(perwt*ed16plus*(1-s
> temocc )        /totwt_80_2559)

. bysort bpl: egen double pct_16pl_nstem2_all_80_2559=total(perwt*ed16plus*(1-s
> temocc2)        /totwt_80_2559)

. bysort bpl: egen double pct_16pl_nstemo_for_80_2559=total(perwt*ed16plus*(1-s
> temocc )*foreign/totwt_80_2559)

. bysort bpl: egen double pct_16pl_nstem2_for_80_2559=total(perwt*ed16plus*(1-s
> temocc2)*foreign/totwt_80_2559)

. 
. bysort bpl: egen double natwt_80_2559             =total(perwt*native)

. bysort bpl: egen double natpct_ed16plus_80_2559   =total(perwt*ed16plus*nativ
> e            /natwt_80_2559)

. bysort bpl: egen double natpct_all_16stemo_80_2559=total(perwt*ed16plus*nativ
> e*stemocc    /natwt_80_2559)

. bysort bpl: egen double natpct_all_16nstem_80_2559=total(perwt*ed16plus*nativ
> e*(1-stemocc)/natwt_80_2559)

. gen              double natpct_16pl_stemo_80_2559 =natpct_all_16stemo_80_2559
> /natpct_ed16plus_80_2559

. gen              double natpct_16pl_nstem_80_2559 =natpct_all_16nstem_80_2559
> /natpct_ed16plus_80_2559

. sum natpct*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
natpct_ed1~9 |  4,853,816    .1912611    .0358807   .1180504   .3075672
natpct_all.. |  4,853,816    .0124038    .0041139   .0049588   .0226831
natpct_all.. |  4,853,816    .1788574    .0326493   .1117382   .2956695
natpct_16p.. |  4,853,816    .0638352    .0131022   .0289275   .0984073
natpct_16p.. |  4,853,816    .9361648    .0131022   .9015927   .9710725

. 
. egen tag=tag(bpl)

. tab  tag

   tag(bpl) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  4,853,765      100.00      100.00
          1 |         51        0.00      100.00
------------+-----------------------------------
      Total |  4,853,816      100.00

. keep if tag==1
(4,853,765 observations deleted)

. keep bpl pct_* totwt_80 nat*

. 
. gen afrshr_ed16plus_80_2559 = pct_ed16plus_afr_80_2559/pct_ed16plus_80_2559

. gen asishr_ed16plus_80_2559 = pct_ed16plus_asi_80_2559/pct_ed16plus_80_2559

. gen canshr_ed16plus_80_2559 = pct_ed16plus_can_80_2559/pct_ed16plus_80_2559

. gen chishr_ed16plus_80_2559 = pct_ed16plus_chi_80_2559/pct_ed16plus_80_2559

. gen cjkshr_ed16plus_80_2559 = pct_ed16plus_cjk_80_2559/pct_ed16plus_80_2559

. gen cukshr_ed16plus_80_2559 = pct_ed16plus_cuk_80_2559/pct_ed16plus_80_2559

. gen forshr_ed16plus_80_2559 = pct_ed16plus_for_80_2559/pct_ed16plus_80_2559

. gen indshr_ed16plus_80_2559 = pct_ed16plus_ind_80_2559/pct_ed16plus_80_2559

. gen latshr_ed16plus_80_2559 = pct_ed16plus_lat_80_2559/pct_ed16plus_80_2559

. gen oasshr_ed16plus_80_2559 = pct_ed16plus_oas_80_2559/pct_ed16plus_80_2559

. gen roashr_ed16plus_80_2559 = pct_ed16plus_roa_80_2559/pct_ed16plus_80_2559

. gen roeshr_ed16plus_80_2559 = pct_ed16plus_roe_80_2559/pct_ed16plus_80_2559

. gen uksshr_ed16plus_80_2559 = pct_ed16plus_uks_80_2559/pct_ed16plus_80_2559

. 
. gen forshr_16pl_stemo_80_2559 = pct_16pl_stemo_for_80_2559/pct_16pl_stemo_all
> _80_2559

. gen forshr_16pl_stem2_80_2559 = pct_16pl_stem2_for_80_2559/pct_16pl_stem2_all
> _80_2559

. 
. gen forshr_ed_16pl_stemo_80_2559 = pct_16pl_stemo_for_80_2559/pct_ed16plus_80
> _2559

. gen forshr_ed_16pl_stem2_80_2559 = pct_16pl_stem2_for_80_2559/pct_ed16plus_80
> _2559

. 
. gen forshr_all_16pl_stemo_80_2559 = pct_16pl_stemo_for_80_2559

. gen forshr_all_16pl_stem2_80_2559 = pct_16pl_stem2_for_80_2559

. 
. gen forshr_16pl_nstemo_80_2559 = pct_16pl_nstemo_for_80_2559/pct_16pl_nstemo_
> all_80_2559

. gen forshr_16pl_nstem2_80_2559 = pct_16pl_nstem2_for_80_2559/pct_16pl_nstem2_
> all_80_2559

. 
. gen forshr_ed_16pl_nstemo_80_2559 = pct_16pl_nstemo_for_80_2559/pct_ed16plus_
> 80_2559

. gen forshr_ed_16pl_nstem2_80_2559 = pct_16pl_nstem2_for_80_2559/pct_ed16plus_
> 80_2559

. 
. gen forshr_all_16pl_nstemo_80_2559 = pct_16pl_nstemo_for_80_2559

. gen forshr_all_16pl_nstem2_80_2559 = pct_16pl_nstem2_for_80_2559

. 
. foreach frag in afrshr asishr canshr chishr cjkshr cukshr forshr indshr latsh
> r oasshr roashr roeshr uksshr {
  2.         qui sum `frag'_ed16plus_80_2559
  3.         qui gen z_`frag'_ed16plus_80_2559 = `frag'_ed16plus_80_2559/`r(sd)
> '
  4.         qui gen z2`frag'_ed16plus_80_2559 = `frag'_ed16plus_80_2559/`=2*`r
> (sd)''
  5. }

. 
. qui sum forshr_16pl_stemo_80_2559

. qui gen z_forshr_16pl_stemo_80_2559 = forshr_16pl_stemo_80_2559/`r(sd)'

. qui gen z2forshr_16pl_stemo_80_2559 = forshr_16pl_stemo_80_2559/`=2*`r(sd)''

. qui sum forshr_16pl_stem2_80_2559

. qui gen z_forshr_16pl_stem2_80_2559 = forshr_16pl_stem2_80_2559/`r(sd)'

. qui gen z2forshr_16pl_stem2_80_2559 = forshr_16pl_stem2_80_2559/`=2*`r(sd)''

. 
. qui sum forshr_ed_16pl_stemo_80_2559

. qui gen z_forshr_ed_16pl_stemo_80_2559 = forshr_ed_16pl_stemo_80_2559/`r(sd)'

. qui gen z2forshr_ed_16pl_stemo_80_2559 = forshr_ed_16pl_stemo_80_2559/`=2*`r(
> sd)''

. qui sum forshr_ed_16pl_stem2_80_2559

. qui gen z_forshr_ed_16pl_stem2_80_2559 = forshr_ed_16pl_stem2_80_2559/`r(sd)'

. qui gen z2forshr_ed_16pl_stem2_80_2559 = forshr_ed_16pl_stem2_80_2559/`=2*`r(
> sd)''

. 
. qui sum forshr_all_16pl_stemo_80_2559

. qui gen z_forshr_all_16pl_stemo_80_2559 = forshr_all_16pl_stemo_80_2559/`r(sd
> )'

. qui gen z2forshr_all_16pl_stemo_80_2559 = forshr_all_16pl_stemo_80_2559/`=2*`
> r(sd)''

. qui sum forshr_all_16pl_stem2_80_2559

. qui gen z_forshr_all_16pl_stem2_80_2559 = forshr_all_16pl_stem2_80_2559/`r(sd
> )'

. qui gen z2forshr_all_16pl_stem2_80_2559 = forshr_all_16pl_stem2_80_2559/`=2*`
> r(sd)''

. 
. qui sum forshr_16pl_nstemo_80_2559

. qui gen z_forshr_16pl_nstemo_80_2559 = forshr_16pl_nstemo_80_2559/`r(sd)'

. qui gen z2forshr_16pl_nstemo_80_2559 = forshr_16pl_nstemo_80_2559/`=2*`r(sd)'
> '

. qui sum forshr_16pl_nstem2_80_2559

. qui gen z_forshr_16pl_nstem2_80_2559 = forshr_16pl_nstem2_80_2559/`r(sd)'

. qui gen z2forshr_16pl_nstem2_80_2559 = forshr_16pl_nstem2_80_2559/`=2*`r(sd)'
> '

. 
. qui sum forshr_ed_16pl_nstemo_80_2559

. qui gen z_forshr_ed_16pl_nstemo_80_2559 = forshr_ed_16pl_nstemo_80_2559/`r(sd
> )'

. qui gen z2forshr_ed_16pl_nstemo_80_2559 = forshr_ed_16pl_nstemo_80_2559/`=2*`
> r(sd)''

. qui sum forshr_ed_16pl_nstem2_80_2559

. qui gen z_forshr_ed_16pl_nstem2_80_2559 = forshr_ed_16pl_nstem2_80_2559/`r(sd
> )'

. qui gen z2forshr_ed_16pl_nstem2_80_2559 = forshr_ed_16pl_nstem2_80_2559/`=2*`
> r(sd)''

. 
. qui sum forshr_all_16pl_nstemo_80_2559

. qui gen z_forshr_all_16pl_nstemo_80_2559 = forshr_all_16pl_nstemo_80_2559/`r(
> sd)'

. qui gen z2forshr_all_16pl_nstemo_80_2559 = forshr_all_16pl_nstemo_80_2559/`=2
> *`r(sd)''

. qui sum forshr_all_16pl_nstem2_80_2559

. qui gen z_forshr_all_16pl_nstem2_80_2559 = forshr_all_16pl_nstem2_80_2559/`r(
> sd)'

. qui gen z2forshr_all_16pl_nstem2_80_2559 = forshr_all_16pl_nstem2_80_2559/`=2
> *`r(sd)''

. 
. sort bpl

. saveold bpl_vars_80.dta, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in
      older Stata formats)
file bpl_vars_80.dta saved

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bpl |         51    28.96078    15.83283          1         56
      native |         51    .9607843    .1960392          0          1
totwt_8~2559 |         51     1903457     2062206     192800   1.06e+07
p~us_80_2559 |         51    .1894593    .0374313   .1207103   .3144726
pct_for~2559 |         51    .0563286    .0475678   .0129506    .205479
-------------+---------------------------------------------------------
pct_ed16pl.. |         51    .0117457    .0086245    .002783   .0347869
p~si_80_2559 |         51    .0043111     .004299   .0007847   .0246294
p~hi_80_2559 |         51    .0007927    .0007665   .0000849   .0040512
pc~d_80_2559 |         51    .0009008    .0007067   .0000983   .0035772
pc~t_80_2559 |         51    .0015358    .0020254   .0002443   .0115582
-------------+---------------------------------------------------------
p~fr_80_2559 |         51    .0004751    .0005031   .0000603   .0035069
p~jk_80_2559 |         51    .0015414    .0017041   .0003662   .0104042
pc~a_80_2559 |         51    .0018689     .002284   .0002411   .0135347
p~as_80_2559 |         51    .0026176    .0032339   .0004219   .0198877
p~uk_80_2559 |         51    .0016586    .0010761   .0003175   .0043215
-------------+---------------------------------------------------------
pc~e_80_2559 |         51    .0028338    .0021129   .0005917   .0095871
p~an_80_2559 |         51    .0008626    .0006523   .0000489   .0029505
p~ks_80_2559 |         51     .000796    .0005647   .0001503   .0026302
pct_16pl_s.. |         51    .0122382    .0047472   .0052372   .0235356
pct_16pl_s.. |         51    .0192023    .0053883   .0109127   .0326883
-------------+---------------------------------------------------------
pct_16pl_s.. |         51     .001178    .0009149   .0000779   .0038946
pct_16pl_s.. |         51    .0020258    .0013786   .0004913   .0060739
pct_16pl_n.. |         51    .1772211    .0342549    .114091   .3015241
pct_16pl_n.. |         51     .170257    .0336354   .1086441   .2946453
pct_16pl_n.. |         51    .0105677    .0078984   .0025419   .0329159
-------------+---------------------------------------------------------
pct_16pl_n.. |         51    .0097198    .0075133    .002257   .0315809
natwt_8~2559 |         51     1744795     1754324     181420    8637220
natpct_ed1~9 |         51    .1894444    .0388052   .1180504   .3075672
natpct_all.. |         51     .011812    .0045929   .0049588   .0226831
natpct_all.. |         51    .1776324    .0356753   .1117382   .2956695
-------------+---------------------------------------------------------
natpct_16p.. |         51    .0612651    .0165573   .0289275   .0984073
natpct_16p.. |         51    .9387349    .0165573   .9015927   .9710725
afrshr_~2559 |         51    .0023289      .00167   .0002954   .0111516
asishr_~2559 |         51    .0215934    .0184996   .0042711   .1068077
canshr_~2559 |         51    .0043575    .0031033   .0004047   .0137276
-------------+---------------------------------------------------------
chishr_~2559 |         51    .0039935    .0033395   .0004318   .0175684
cjkshr_~2559 |         51    .0076996    .0073242   .0017271   .0451188
cukshr_~2559 |         51     .008302    .0046171   .0026144   .0211193
forshr_ed1~9 |         51    .0585143    .0351355    .020915   .1568837
indshr_~2559 |         51    .0046382    .0031922    .000504   .0161344
-------------+---------------------------------------------------------
latshr_~2559 |         51     .007684    .0102981   .0014771    .067377
oasshr_~2559 |         51    .0129617    .0139601   .0020679   .0862448
roashr_~2559 |         51    .0092555    .0098968   .0011817   .0586944
roeshr_~2559 |         51     .014044    .0085701   .0039216    .044769
uksshr_~2559 |         51    .0039445     .002189   .0008715   .0086546
-------------+---------------------------------------------------------
forshr_16p.. |         51    .0891252    .0482467   .0136986   .2155992
forshr_16p.. |         51     .100557     .051692    .021645   .2450905
forshr_ed_.. |         51    .0058743    .0039294   .0004284   .0175661
forshr_ed_.. |         51    .0103071    .0060118   .0025202   .0273954
forshr_all.. |         51     .001178    .0009149   .0000779   .0038946
-------------+---------------------------------------------------------
forshr_all.. |         51    .0020258    .0013786   .0004913   .0060739
forshr_16p.. |         51    .0563287    .0344524   .0193258   .1517536
forshr_16p.. |         51    .0536768    .0338932   .0169811   .1506558
forshr_ed_.. |         51    .0526401    .0321998   .0187364   .1427431
forshr_ed_.. |         51    .0482073    .0305582   .0156863   .1369535
-------------+---------------------------------------------------------
forshr_all.. |         51    .0105677    .0078984   .0025419   .0329159
forshr_all.. |         51    .0097198    .0075133    .002257   .0315809
z_afrsh~2559 |         51     1.39454           1   .1769003   6.677673
z2afrsh~2559 |         51    .6972701          .5   .0884501   3.338837
z_asish~2559 |         51    1.167238           1   .2308741   5.773526
-------------+---------------------------------------------------------
z2asish~2559 |         51    .5836192          .5    .115437   2.886763
z_cansh~2559 |         51     1.40414           1    .130407   4.423509
z2cansh~2559 |         51      .70207          .5   .0652035   2.211754
z_chish~2559 |         51    1.195835           1   .1292935   5.260741
z2chish~2559 |         51    .5979173          .5   .0646468   2.630371
-------------+---------------------------------------------------------
z_cjksh~2559 |         51    1.051251           1   .2358079   6.160194
z2cjksh~2559 |         51    .5256256          .5    .117904   3.080097
z_cuksh~2559 |         51    1.798111           1   .5662394   4.574162
z2cuksh~2559 |         51    .8990555          .5   .2831197   2.287081
z_forshr_e.. |         51    1.665392           1   .5952684    4.46511
-------------+---------------------------------------------------------
z2forshr_e.. |         51    .8326961          .5   .2976342   2.232555
z_indsh~2559 |         51    1.452987           1   .1578945   5.054294
z2indsh~2559 |         51    .7264934          .5   .0789473   2.527147
z_latsh~2559 |         51    .7461522           1   .1434343    6.54265
z2latsh~2559 |         51    .3730761          .5   .0717172   3.271325
-------------+---------------------------------------------------------
z_oassh~2559 |         51    .9284792           1   .1481328   6.177953
z2oassh~2559 |         51    .4642396          .5   .0740664   3.088976
z_roash~2559 |         51    .9352031           1   .1194002   5.930622
z2roash~2559 |         51    .4676016          .5   .0597001   2.965311
z_roesh~2559 |         51    1.638724           1    .457589   5.223885
-------------+---------------------------------------------------------
z2roesh~2559 |         51     .819362          .5   .2287945   2.611942
z_ukssh~2559 |         51    1.802004           1   .3981125   3.953717
z2ukssh~2559 |         51    .9010019          .5   .1990563   1.976859
z_forshr_1.. |         51    1.847282           1    .283929   4.468687
z2forshr_1.. |         51     .923641          .5   .1419645   2.234343
-------------+---------------------------------------------------------
z_forshr_1.. |         51     1.94531           1   .4187303    4.74136
z2forshr_1.. |         51    .9726551          .5   .2093652    2.37068
z_forshr_e.. |         51    1.494959           1   .1090372    4.47044
z2forshr_e.. |         51    .7474795          .5   .0545186    2.23522
z_forshr_e.. |         51    1.714474           1   .4192035   4.556946
-------------+---------------------------------------------------------
z2forshr_e.. |         51    .8572372          .5   .2096018   2.278473
z_forshr_a.. |         51    1.287586           1   .0851882   4.257005
z2forshr_a.. |         51    .6437929          .5   .0425941   2.128503
z_forshr_a.. |         51    1.469457           1   .3563705   4.405735
z2forshr_a.. |         51    .7347286          .5   .1781853   2.202868
-------------+---------------------------------------------------------
z_forshr_1.. |         51    1.634974           1   .5609438   4.404735
z2forshr_1.. |         51    .8174872          .5   .2804719   2.202367
z_forshr_1.. |         51    1.583705           1   .5010193    4.44502
z2forshr_1.. |         51    .7918523          .5   .2505096    2.22251
z_forshr_e.. |         51    1.634795           1    .581879   4.433043
-------------+---------------------------------------------------------
z2forshr_e.. |         51    .8173975          .5   .2909395   2.216522
z_forshr_e.. |         51    1.577558           1   .5133252   4.481731
z2forshr_e.. |         51     .788779          .5   .2566626   2.240866
z_forshr_a.. |         51    1.337959           1   .3218273   4.167438
z2forshr_a.. |         51    .6689797          .5   .1609136   2.083719
-------------+---------------------------------------------------------
z_forshr_a.. |         51    1.293687           1   .3004069   4.203345
z2forshr_a.. |         51    .6468433          .5   .1502035   2.101672

. corr   forshr_16pl_stem*_80_2559 *shr_ed16plus_80_2559
(obs=51)

             | forshr.. forshr.. afr~2559 asi~2559 can~2559 chi~2559 cjk~2559
-------------+---------------------------------------------------------------
forshr_16p.. |   1.0000
forshr_16p.. |   0.9346   1.0000
afrshr_~2559 |   0.6123   0.5638   1.0000
asishr_~2559 |   0.6533   0.6771   0.3029   1.0000
canshr_~2559 |   0.2407   0.1787  -0.0562   0.0675   1.0000
chishr_~2559 |   0.6061   0.6023   0.2499   0.9455   0.0521   1.0000
cjkshr_~2559 |   0.5555   0.5633   0.1974   0.9744   0.0992   0.9578   1.0000
cukshr_~2559 |   0.4943   0.4298   0.1637   0.2695   0.9128   0.2413   0.2697
forshr_ed1~9 |   0.8682   0.8724   0.5493   0.8299   0.2700   0.7742   0.7692
indshr_~2559 |   0.7558   0.8307   0.4979   0.5184  -0.1638   0.4392   0.3673
latshr_~2559 |   0.5420   0.5671   0.4014   0.2404   0.0829   0.2333   0.1775
oasshr_~2559 |   0.5480   0.5632   0.2277   0.9804   0.1144   0.9133   0.9782
roashr_~2559 |   0.5664   0.5808   0.2595   0.9809   0.1055   0.9169   0.9629
roeshr_~2559 |   0.8559   0.8329   0.6032   0.4911   0.3241   0.4377   0.4089
uksshr_~2559 |   0.7015   0.6532   0.4249   0.4729   0.5075   0.4351   0.4283
z_afrsh~2559 |   0.6123   0.5638   1.0000   0.3029  -0.0562   0.2499   0.1974
z2afrsh~2559 |   0.6123   0.5638   1.0000   0.3029  -0.0562   0.2499   0.1974
z_asish~2559 |   0.6533   0.6771   0.3029   1.0000   0.0675   0.9455   0.9744
z2asish~2559 |   0.6533   0.6771   0.3029   1.0000   0.0675   0.9455   0.9744
z_cansh~2559 |   0.2407   0.1787  -0.0562   0.0675   1.0000   0.0521   0.0992
z2cansh~2559 |   0.2407   0.1787  -0.0562   0.0675   1.0000   0.0521   0.0992
z_chish~2559 |   0.6061   0.6023   0.2499   0.9455   0.0521   1.0000   0.9578
z2chish~2559 |   0.6061   0.6023   0.2499   0.9455   0.0521   1.0000   0.9578
z_cjksh~2559 |   0.5555   0.5633   0.1974   0.9744   0.0992   0.9578   1.0000
z2cjksh~2559 |   0.5555   0.5633   0.1974   0.9744   0.0992   0.9578   1.0000
z_cuksh~2559 |   0.4943   0.4298   0.1637   0.2695   0.9128   0.2413   0.2697
z2cuksh~2559 |   0.4943   0.4298   0.1637   0.2695   0.9128   0.2413   0.2697
z_forshr_e.. |   0.8682   0.8724   0.5493   0.8299   0.2700   0.7742   0.7692
z2forshr_e.. |   0.8682   0.8724   0.5493   0.8299   0.2700   0.7742   0.7692
z_indsh~2559 |   0.7558   0.8307   0.4979   0.5184  -0.1638   0.4392   0.3673
z2indsh~2559 |   0.7558   0.8307   0.4979   0.5184  -0.1638   0.4392   0.3673
z_latsh~2559 |   0.5420   0.5671   0.4014   0.2404   0.0829   0.2333   0.1775
z2latsh~2559 |   0.5420   0.5671   0.4014   0.2404   0.0829   0.2333   0.1775
z_oassh~2559 |   0.5480   0.5632   0.2277   0.9804   0.1144   0.9133   0.9782
z2oassh~2559 |   0.5480   0.5632   0.2277   0.9804   0.1144   0.9133   0.9782
z_roash~2559 |   0.5664   0.5808   0.2595   0.9809   0.1055   0.9169   0.9629
z2roash~2559 |   0.5664   0.5808   0.2595   0.9809   0.1055   0.9169   0.9629
z_roesh~2559 |   0.8559   0.8329   0.6032   0.4911   0.3241   0.4377   0.4089
z2roesh~2559 |   0.8559   0.8329   0.6032   0.4911   0.3241   0.4377   0.4089
z_ukssh~2559 |   0.7015   0.6532   0.4249   0.4729   0.5075   0.4351   0.4283
z2ukssh~2559 |   0.7015   0.6532   0.4249   0.4729   0.5075   0.4351   0.4283

             | cuk~2559 forshr.. ind~2559 lat~2559 oas~2559 roa~2559 roe~2559
-------------+---------------------------------------------------------------
cukshr_~2559 |   1.0000
forshr_ed1~9 |   0.5213   1.0000
indshr_~2559 |   0.0630   0.6019   1.0000
latshr_~2559 |   0.2135   0.6444   0.3315   1.0000
oasshr_~2559 |   0.2851   0.7769   0.3533   0.1870   1.0000
roashr_~2559 |   0.2839   0.7879   0.3747   0.2111   0.9948   1.0000
roeshr_~2559 |   0.5754   0.8097   0.6676   0.4802   0.3934   0.4000   1.0000
uksshr_~2559 |   0.8152   0.7169   0.3652   0.3328   0.4391   0.4492   0.7542
z_afrsh~2559 |   0.1637   0.5493   0.4979   0.4014   0.2277   0.2595   0.6032
z2afrsh~2559 |   0.1637   0.5493   0.4979   0.4014   0.2277   0.2595   0.6032
z_asish~2559 |   0.2695   0.8299   0.5184   0.2404   0.9804   0.9809   0.4911
z2asish~2559 |   0.2695   0.8299   0.5184   0.2404   0.9804   0.9809   0.4911
z_cansh~2559 |   0.9128   0.2700  -0.1638   0.0829   0.1144   0.1055   0.3241
z2cansh~2559 |   0.9128   0.2700  -0.1638   0.0829   0.1144   0.1055   0.3241
z_chish~2559 |   0.2413   0.7742   0.4392   0.2333   0.9133   0.9169   0.4377
z2chish~2559 |   0.2413   0.7742   0.4392   0.2333   0.9133   0.9169   0.4377
z_cjksh~2559 |   0.2697   0.7692   0.3673   0.1775   0.9782   0.9629   0.4089
z2cjksh~2559 |   0.2697   0.7692   0.3673   0.1775   0.9782   0.9629   0.4089
z_cuksh~2559 |   1.0000   0.5213   0.0630   0.2135   0.2851   0.2839   0.5754
z2cuksh~2559 |   1.0000   0.5213   0.0630   0.2135   0.2851   0.2839   0.5754
z_forshr_e.. |   0.5213   1.0000   0.6019   0.6444   0.7769   0.7879   0.8097
z2forshr_e.. |   0.5213   1.0000   0.6019   0.6444   0.7769   0.7879   0.8097
z_indsh~2559 |   0.0630   0.6019   1.0000   0.3315   0.3533   0.3747   0.6676
z2indsh~2559 |   0.0630   0.6019   1.0000   0.3315   0.3533   0.3747   0.6676
z_latsh~2559 |   0.2135   0.6444   0.3315   1.0000   0.1870   0.2111   0.4802
z2latsh~2559 |   0.2135   0.6444   0.3315   1.0000   0.1870   0.2111   0.4802
z_oassh~2559 |   0.2851   0.7769   0.3533   0.1870   1.0000   0.9948   0.3934
z2oassh~2559 |   0.2851   0.7769   0.3533   0.1870   1.0000   0.9948   0.3934
z_roash~2559 |   0.2839   0.7879   0.3747   0.2111   0.9948   1.0000   0.4000
z2roash~2559 |   0.2839   0.7879   0.3747   0.2111   0.9948   1.0000   0.4000
z_roesh~2559 |   0.5754   0.8097   0.6676   0.4802   0.3934   0.4000   1.0000
z2roesh~2559 |   0.5754   0.8097   0.6676   0.4802   0.3934   0.4000   1.0000
z_ukssh~2559 |   0.8152   0.7169   0.3652   0.3328   0.4391   0.4492   0.7542
z2ukssh~2559 |   0.8152   0.7169   0.3652   0.3328   0.4391   0.4492   0.7542

             | uks~2559 z_afrs~9 z2afrs~9 z_asis~9 z2asis~9 z_cans~9 z2cans~9
-------------+---------------------------------------------------------------
uksshr_~2559 |   1.0000
z_afrsh~2559 |   0.4249   1.0000
z2afrsh~2559 |   0.4249   1.0000   1.0000
z_asish~2559 |   0.4729   0.3029   0.3029   1.0000
z2asish~2559 |   0.4729   0.3029   0.3029   1.0000   1.0000
z_cansh~2559 |   0.5075  -0.0562  -0.0562   0.0675   0.0675   1.0000
z2cansh~2559 |   0.5075  -0.0562  -0.0562   0.0675   0.0675   1.0000   1.0000
z_chish~2559 |   0.4351   0.2499   0.2499   0.9455   0.9455   0.0521   0.0521
z2chish~2559 |   0.4351   0.2499   0.2499   0.9455   0.9455   0.0521   0.0521
z_cjksh~2559 |   0.4283   0.1974   0.1974   0.9744   0.9744   0.0992   0.0992
z2cjksh~2559 |   0.4283   0.1974   0.1974   0.9744   0.9744   0.0992   0.0992
z_cuksh~2559 |   0.8152   0.1637   0.1637   0.2695   0.2695   0.9128   0.9128
z2cuksh~2559 |   0.8152   0.1637   0.1637   0.2695   0.2695   0.9128   0.9128
z_forshr_e.. |   0.7169   0.5493   0.5493   0.8299   0.8299   0.2700   0.2700
z2forshr_e.. |   0.7169   0.5493   0.5493   0.8299   0.8299   0.2700   0.2700
z_indsh~2559 |   0.3652   0.4979   0.4979   0.5184   0.5184  -0.1638  -0.1638
z2indsh~2559 |   0.3652   0.4979   0.4979   0.5184   0.5184  -0.1638  -0.1638
z_latsh~2559 |   0.3328   0.4014   0.4014   0.2404   0.2404   0.0829   0.0829
z2latsh~2559 |   0.3328   0.4014   0.4014   0.2404   0.2404   0.0829   0.0829
z_oassh~2559 |   0.4391   0.2277   0.2277   0.9804   0.9804   0.1144   0.1144
z2oassh~2559 |   0.4391   0.2277   0.2277   0.9804   0.9804   0.1144   0.1144
z_roash~2559 |   0.4492   0.2595   0.2595   0.9809   0.9809   0.1055   0.1055
z2roash~2559 |   0.4492   0.2595   0.2595   0.9809   0.9809   0.1055   0.1055
z_roesh~2559 |   0.7542   0.6032   0.6032   0.4911   0.4911   0.3241   0.3241
z2roesh~2559 |   0.7542   0.6032   0.6032   0.4911   0.4911   0.3241   0.3241
z_ukssh~2559 |   1.0000   0.4249   0.4249   0.4729   0.4729   0.5075   0.5075
z2ukssh~2559 |   1.0000   0.4249   0.4249   0.4729   0.4729   0.5075   0.5075

             | z_chis~9 z2chis~9 z_cjks~9 z2cjks~9 z_cuks~9 z2cuks~9 z_fors..
-------------+---------------------------------------------------------------
z_chish~2559 |   1.0000
z2chish~2559 |   1.0000   1.0000
z_cjksh~2559 |   0.9578   0.9578   1.0000
z2cjksh~2559 |   0.9578   0.9578   1.0000   1.0000
z_cuksh~2559 |   0.2413   0.2413   0.2697   0.2697   1.0000
z2cuksh~2559 |   0.2413   0.2413   0.2697   0.2697   1.0000   1.0000
z_forshr_e.. |   0.7742   0.7742   0.7692   0.7692   0.5213   0.5213   1.0000
z2forshr_e.. |   0.7742   0.7742   0.7692   0.7692   0.5213   0.5213   1.0000
z_indsh~2559 |   0.4392   0.4392   0.3673   0.3673   0.0630   0.0630   0.6019
z2indsh~2559 |   0.4392   0.4392   0.3673   0.3673   0.0630   0.0630   0.6019
z_latsh~2559 |   0.2333   0.2333   0.1775   0.1775   0.2135   0.2135   0.6444
z2latsh~2559 |   0.2333   0.2333   0.1775   0.1775   0.2135   0.2135   0.6444
z_oassh~2559 |   0.9133   0.9133   0.9782   0.9782   0.2851   0.2851   0.7769
z2oassh~2559 |   0.9133   0.9133   0.9782   0.9782   0.2851   0.2851   0.7769
z_roash~2559 |   0.9169   0.9169   0.9629   0.9629   0.2839   0.2839   0.7879
z2roash~2559 |   0.9169   0.9169   0.9629   0.9629   0.2839   0.2839   0.7879
z_roesh~2559 |   0.4377   0.4377   0.4089   0.4089   0.5754   0.5754   0.8097
z2roesh~2559 |   0.4377   0.4377   0.4089   0.4089   0.5754   0.5754   0.8097
z_ukssh~2559 |   0.4351   0.4351   0.4283   0.4283   0.8152   0.8152   0.7169
z2ukssh~2559 |   0.4351   0.4351   0.4283   0.4283   0.8152   0.8152   0.7169

             | z2fors.. z_i~2559 z2i~2559 z_l~2559 z2l~2559 z_o~2559 z2o~2559
-------------+---------------------------------------------------------------
z2forshr_e.. |   1.0000
z_indsh~2559 |   0.6019   1.0000
z2indsh~2559 |   0.6019   1.0000   1.0000
z_latsh~2559 |   0.6444   0.3315   0.3315   1.0000
z2latsh~2559 |   0.6444   0.3315   0.3315   1.0000   1.0000
z_oassh~2559 |   0.7769   0.3533   0.3533   0.1870   0.1870   1.0000
z2oassh~2559 |   0.7769   0.3533   0.3533   0.1870   0.1870   1.0000   1.0000
z_roash~2559 |   0.7879   0.3747   0.3747   0.2111   0.2111   0.9948   0.9948
z2roash~2559 |   0.7879   0.3747   0.3747   0.2111   0.2111   0.9948   0.9948
z_roesh~2559 |   0.8097   0.6676   0.6676   0.4802   0.4802   0.3934   0.3934
z2roesh~2559 |   0.8097   0.6676   0.6676   0.4802   0.4802   0.3934   0.3934
z_ukssh~2559 |   0.7169   0.3652   0.3652   0.3328   0.3328   0.4391   0.4391
z2ukssh~2559 |   0.7169   0.3652   0.3652   0.3328   0.3328   0.4391   0.4391

             | z_roas~9 z2roas~9 z_roes~9 z2roes~9 z_u~2559 z2u~2559
-------------+------------------------------------------------------
z_roash~2559 |   1.0000
z2roash~2559 |   1.0000   1.0000
z_roesh~2559 |   0.4000   0.4000   1.0000
z2roesh~2559 |   0.4000   0.4000   1.0000   1.0000
z_ukssh~2559 |   0.4492   0.4492   0.7542   0.7542   1.0000
z2ukssh~2559 |   0.4492   0.4492   0.7542   0.7542   1.0000   1.0000


. gsort -forshr_16pl_stemo_80_2559

. list bpl forshr*

     +-----------------------------------------------------------------------+
  1. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   6 | .1568837 | .2155992 | .2039378 |  .017324 | .0238374 | .0038414 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0052856  | .1517536  | .1506558  | .1395598  | .1330463  | .0309455  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0295013                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  2. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  36 | .1509436 | .2093634 | .2450905 | .0116297 | .0233567 | .0024904 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0050017  | .1475077  | .1410265  | .1393139  | .1275869  | .0298333  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0273221                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  3. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  34 |  .127946 | .2074122 | .2286305 | .0175661 | .0273954 | .0038946 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0060739  | .1205932  | .1142392  |   .11038  | .1005507  | .0244726  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0222933                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  4. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  17 | .1058356 | .1898377 | .2221738 | .0113177 | .0214574 | .0021936 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .004159  |   .10051  | .0933985  | .0945178  | .0843782  | .0183198  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0163545                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  5. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  11 | .1074416 | .1614583 | .1564626 | .0066481 | .0098649 | .0020906 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0031022  | .1051219  | .1041428  | .1007935  | .0975767  | .0316968  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0306852                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  6. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  53 | .0775041 | .1344994 | .1145698 | .0113037 | .0134327 |  .002446 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0029066  | .0722745  | .0725811  | .0662003  | .0640714  | .0143247  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0138641                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  7. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  12 | .1264925 | .1320865 | .1705054 | .0065976 | .0155598 | .0011318 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0026692  | .1261984  | .1220727  | .1198949  | .1109327  | .0205674  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                                 .01903                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  8. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   9 | .0830924 |  .131728 | .1332995 | .0109767 | .0155208 | .0027038 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0038231  | .0786712  | .0764761  | .0721157  | .0675716  | .0177637  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0166444                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
  9. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  50 | .0582902 | .1292517 | .1176471 | .0082038 | .0120898 | .0017679 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0026054  | .0534809  | .0514918  | .0500864  | .0462003  | .0107937  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0099563                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 10. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  44 | .0666842 |     .125 | .1396104 | .0063258 | .0113337 | .0012063 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0021612  | .0635758  |  .060241  | .0603585  | .0553506  | .0115099  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0105549                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 11. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  25 | .0773768 | .1247357 | .1349532 | .0098857 | .0154485 | .0024075 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0037622  | .0733003  | .0699338  |  .067491  | .0619282  | .0164363  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0150815                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 12. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  24 | .0973455 |     .124 |   .16032 | .0125738 | .0225788 | .0029184 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0052406  | .0943377  | .0870227  | .0847717  | .0747668  | .0196757  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0173536                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 13. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  10 | .0641227 | .1230159 | .1524927 | .0121951 | .0204563 | .0024121 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0040461  | .0576419  | .0504316  | .0519276  | .0436664  | .0102708  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0086368                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 14. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  26 | .0706077 | .1217573 |  .149041 | .0088947 | .0175755 | .0014712 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0029071  | .0665765  |  .060122  | .0617129  | .0530322  | .0102077  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0087718                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 15. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  42 |  .058497 | .1214765 | .1279287 | .0087758 | .0149576 | .0014285 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0024348  | .0535929  | .0493041  | .0497212  | .0435394  | .0080937  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0070874                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 16. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  15 | .1479337 | .1106383 |  .142487 | .0051907 | .0109802 | .0011969 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .002532  | .1497696  | .1483885  | .1427431  | .1369535  | .0329159  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0315809                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 17. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  48 | .0647953 |  .108913 | .1186518 | .0087742 | .0134526 | .0016941 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0025974  | .0609297  | .0579083  | .0560211  | .0513427  | .0108163  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                                .009913                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 18. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   4 | .0574434 | .1029412 | .0989011 | .0071688 | .0108928 | .0013715 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .002084  | .0540378  | .0523122  | .0502746  | .0465506  | .0096185  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                                .008906                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 19. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  51 | .0719655 | .0958535 | .1085801 | .0067243 | .0108043 | .0014816 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0023806  | .0701633  | .0679196  | .0652412  | .0611613  | .0143751  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0134762                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 20. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  27 | .0409176 | .0931507 | .0908046 | .0056248 | .0087129 | .0012019 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0018618  | .0375609  | .0356228  | .0352928  | .0322047  | .0075416  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0068817                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 21. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  18 | .0439045 | .0901408 | .0941812 | .0057034 | .0093275 | .0008294 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0013565  | .0407814  | .0383778  |  .038201  |  .034577  | .0055555  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0050284                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 22. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  22 | .0443696 |  .090011 | .0817439 | .0060038 | .0087861 | .0009585 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0014027  | .0411077  | .0398687  | .0383658  | .0355835  |  .006125  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0056808                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 23. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  39 | .0533979 | .0876269 | .1268853 | .0063413 | .0144245 | .0010071 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0022908  | .0507276  | .0439722  | .0470566  | .0389734  | .0074731  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0061894                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 24. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  13 | .0427455 |  .079798 | .0741389 | .0040106 | .0064474 | .0006717 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0010797  | .0407847  | .0397554  | .0387349  | .0362981  |  .006487  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0060789                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 25. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  29 |  .041459 | .0763158 | .0982381 | .0051017 | .0107899 | .0008517 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0018012  | .0389619  | .0344532  | .0363572  | .0306691  | .0060694  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0051198                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 26. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  46 |  .020915 | .0714286 | .0685714 | .0021786 | .0052288 | .0003756 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0009015  | .0193258  | .0169811  | .0187364  | .0156863  | .0032304  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0027045                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 27. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  41 | .0559993 | .0690162 | .0758621 | .0038705 |  .007247 | .0008109 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0015183  |  .055226  | .0539015  | .0521288  | .0487524  | .0109215  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0102141                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 28. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  55 | .0412064 | .0688488 | .0776575 | .0035654 | .0071307 | .0006305 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0012611  | .0396967  | .0375209  |  .037641  | .0340756  | .0066567  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0060262                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 29. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  37 | .0325969 | .0686378 | .0725758 | .0033632 | .0063124 | .0005096 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0009565  | .0307399  | .0287884  | .0292337  | .0262845  | .0044296  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0039827                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 30. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  31 | .0328654 | .0680851 | .0620985 | .0026424 | .0047894 |  .000503 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0009117  | .0314433  | .0304223  |  .030223  |  .028076  | .0057529  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0053442                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 31. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  40 | .0369364 |  .065073 | .0713087 |  .004436 | .0076951 | .0007756 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0013454  | .0348781  | .0327786  | .0325005  | .0292414  | .0056823  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0051125                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 32. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  32 | .0743775 | .0621118 |    .0625 | .0032765 | .0055701 | .0005275 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0008967  | .0750605  | .0755396  | .0711009  | .0688073  | .0114464  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0110771                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 33. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  33 | .0431382 |      .06 | .0691145 | .0049775 | .0075847 | .0010492 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0015988  | .0416128  | .0399361  | .0381607  | .0355534  |  .008044  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0074944                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 34. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   8 | .0465292 | .0593333 | .0587103 | .0051829 | .0071046 | .0013589 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0018627  | .0453037  | .0448523  | .0413464  | .0394246  | .0108404  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0103365                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 35. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  54 | .0350061 | .0590406 | .1072875 | .0032376 | .0107244 | .0003908 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0012945  | .0336116  | .0269784  | .0317685  | .0242817  | .0038348  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                                .002931                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 36. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  49 | .0472173 | .0582751 | .0494753 | .0040565 | .0053545 |   .00091 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0012012  |   .04639  | .0469432  | .0431608  | .0418627  | .0096826  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0093914                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 37. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   2 | .0555819 |  .056962 | .0669643 | .0042755 | .0071259 | .0009336 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .001556  |   .05547  | .0542265  | .0513064  | .0484561  | .0112033  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0105809                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 38. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  23 | .0475185 | .0564972 | .0851735 | .0026399 | .0071278 | .0004243 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0011455  | .0470784  | .0440795  | .0448786  | .0403907  | .0072126  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0064913                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 39. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  20 | .0369375 | .0548673 | .0800427 | .0030864 | .0074671 | .0006352 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0015367  | .0358688  | .0325025  | .0338511  | .0294703  | .0069664  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0060648                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 40. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  47 | .0320292 | .0521277 | .0609137 |  .003311 | .0064869 | .0004978 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0009752  |  .030666  | .0285866  | .0287182  | .0255423  | .0043173  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0038398                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 41. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  28 | .0248555 | .0514469 | .0513274 | .0023121 | .0041908 | .0003299 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .000598  | .0236042  |  .022502  | .0225434  | .0206647  |  .003217  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0029489                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 42. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  45 | .0333988 | .0494382 | .0496815 | .0022748 | .0040327 | .0003344 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0005927  | .0326252  | .0319604  |  .031124  | .0293661  | .0045745  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0043162                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 43. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  35 | .0443463 | .0482897 | .0634006 | .0046074 | .0084469 | .0008881 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0016282  | .0439304  | .0414175  | .0397389  | .0358994  | .0076601  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                                 .00692                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 44. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   5 | .0211314 | .0460251 | .0481928 | .0018303 | .0039933 |  .000241 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0005259  | .0201005  | .0186865  | .0193012  | .0171381  | .0025419  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                                .002257                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 45. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  16 |  .023918 | .0446097 | .0379747 | .0034169 | .0042711 | .0006278 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0007847  | .0222017  | .0221367  | .0205011  | .0196469  | .0037667  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0036097                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 46. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |   1 | .0283093 | .0426908 | .0612403 | .0028834 | .0069026 | .0004107 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0009833  | .0272676  |  .024126  |  .025426  | .0214067  | .0036221  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0030495                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 47. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  21 | .0289509 | .0422833 |      .05 | .0020753 | .0047733 | .0002636 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0006063  | .0282628  | .0267294  | .0268756  | .0241776  |  .003414  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0030713                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 48. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  19 | .0300321 | .0412844 | .0508671 |  .001808 | .0044194 |  .000306 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .000748  | .0295168  | .0280497  | .0282242  | .0256127  | .0047768  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0043348                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 49. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  30 | .0209749 | .0310559 | .0390071 | .0014771 | .0032496 | .0003014 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .000663  | .0204715  | .0193361  | .0194978  | .0177253  | .0039781  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0036164                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 50. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  56 | .0231855 | .0176471 |  .021645 | .0015121 | .0025202 | .0002948 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     | .0004913  | .0237045  | .0233885  | .0216734  | .0206653  | .0042252  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0040287                                |
     +-----------------------------------------------------------------------+

     +-----------------------------------------------------------------------+
 51. | bpl | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. | forshr.. |
     |  38 | .0282776 | .0136986 | .0955414 | .0004284 | .0064267 | .0000779 |
     |-----------------------------------------------------------------------|
     | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  | forshr..  |
     |  .001169  | .0287483  | .0234267  | .0278492  | .0218509  | .0050659  |
     |-----------------------------------------------------------------------|
     |                               forshr..                                |
     |                               .0039747                                |
     +-----------------------------------------------------------------------+

. 
. log close
      name:  <unnamed>
       log:  /home/data/ransom/CollegeMaj/ACS-immigration/Data/cr_bpl_vars_80.l
> og
  log type:  text
 closed on:   1 Feb 2018, 13:05:58
-------------------------------------------------------------------------------
